html/CD.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2026-06-04 qui 11:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Circuitos Digitais</title>
<meta name="author" content="Felipe Canteiro" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Circuitos Digitais</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org36d2b7d">1. Introdução</a>
<ul>
<li><a href="#orgade50fa">1.1. Espaços de valores</a></li>
<li><a href="#org52c0655">1.2. Profundidade de bits</a></li>
<li><a href="#org7e208f4">1.3. Digitalização</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org36d2b7d" class="outline-2">
<h2 id="org36d2b7d"><span class="section-number-2">1.</span> Introdução</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Quantificação: processo da divisão de um sinal analógico numa série de saídas discretas, cada uma com uma amplitude constante</li>
<li>Bit: dígito binário
<ul class="org-ul">
<li>b minúsculo</li>
</ul></li>
<li>Byte: 8bits
<ul class="org-ul">
<li>B maiúsculo</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgade50fa" class="outline-3">
<h3 id="orgade50fa"><span class="section-number-3">1.1.</span> Espaços de valores</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>COnjunto de todas as combinações possíveis de valoires ou códigos para determinado número de dígitos</li>
</ul>
</div>
</div>
<div id="outline-container-org52c0655" class="outline-3">
<h3 id="org52c0655"><span class="section-number-3">1.2.</span> Profundidade de bits</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Resolução de cores
<ul class="org-ul">
<li>Número de bits por pixel
<ul class="org-ul">
<li>1 bit: 2 cores</li>
<li>8 bits: 256 cores</li>
<li>24 bits: RGB</li>
<li>32 bits: CMYK (Cyan, Magenta, Yellow, Black)</li>
<li>36 bits: RGB de 12 bits por cor</li>
<li>48 bits: CMYK de 12 bits por cor</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7e208f4" class="outline-3">
<h3 id="org7e208f4"><span class="section-number-3">1.3.</span> Digitalização</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Processo de conversão de uma informação em um código digital
<ul class="org-ul">
<li>Quantificação: grandezas analógicas com representação discreta</li>
<li>Codificação: letras, símbolos, instruções</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Felipe Canteiro</p>
<p class="date">Created: 2026-06-04 qui 11:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
